public class Math2_CountN {

//  В переменной n хранится натуральное двузначное число.
//  Создайте программу, вычисляющую и выводящую на экран сумму цифр числа n.

    public static void main(String[] args) {
        int n = 27;
        int result = Math4_CountThree.countNumberSum(n);
        System.out.println(result);
    }

}


