public class Math3_Rounding {

//    В переменной n хранится вещественное число с ненулевой дробной частью.
//    Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.

    public static void main(String[] args) {
        float num = 3.33f;
        System.out.println(Math.round(num));
    }
}
